
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>习惯与技巧 · 前端面试之道</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="tony">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../../source/css/website.css">
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../Safety/safety-cn.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"Tony-Code","repo":"UED-Interview","type":"star","size":"small","count":true}]};
    </script>

    
        <link rel="shortcut icon" href='../../source/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../../source/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../../source/images/favicon.ico'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../../source/images/favicon.ico">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../../source/images/favicon.ico">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Algorithm/algorithm-ch.html">
            
                <a href="../Algorithm/algorithm-ch.html">
            
                    
                    算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Browser/browser-ch.html">
            
                <a href="../Browser/browser-ch.html">
            
                    
                    浏览器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../DataStruct/dataStruct-zh.html">
            
                <a href="../DataStruct/dataStruct-zh.html">
            
                    
                    数据结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Framework/framework-zh.html">
            
                <a href="../Framework/framework-zh.html">
            
                    
                    框架
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Framework/react-zh.html">
            
                <a href="../Framework/react-zh.html">
            
                    
                    react
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Framework/vue-zh.html">
            
                <a href="../Framework/vue-zh.html">
            
                    
                    vue
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Git/git-zh.html">
            
                <a href="../Git/git-zh.html">
            
                    
                    Git
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../JS/JS-ch.html">
            
                <a href="../JS/JS-ch.html">
            
                    
                    JS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../MP/mp-ch.html">
            
                <a href="../MP/mp-ch.html">
            
                    
                    微信小程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../Network/Network-zh.html">
            
                <a href="../Network/Network-zh.html">
            
                    
                    网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../Performance/performance-ch.html">
            
                <a href="../Performance/performance-ch.html">
            
                    
                    性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="../Safety/safety-cn.html">
            
                <a href="../Safety/safety-cn.html">
            
                    
                    安全
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="How-to-use-your-time-correctly.html">
            
                <a href="How-to-use-your-time-correctly.html">
            
                    
                    习惯与技巧
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >习惯与技巧</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <!-- START doctoc generated TOC please keep comment here to allow auto update --><!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE --><html><head></head><body><p><strong>Table of Contents</strong>  <em>generated with <a href="https://github.com/thlorenz/doctoc" target="_blank">DocToc</a></em></p>
<ul>
<li><a href="#%E8%8A%B1%E6%97%B6%E9%97%B4%E8%A1%A5%E5%9F%BA%E7%A1%80%E8%AF%BB%E6%96%87%E6%A1%A3">&#x82B1;&#x65F6;&#x95F4;&#x8865;&#x57FA;&#x7840;&#xFF0C;&#x8BFB;&#x6587;&#x6863;</a></li>
<li><a href="#%E5%AD%A6%E4%BC%9A%E6%90%9C%E7%B4%A2">&#x5B66;&#x4F1A;&#x641C;&#x7D22;</a></li>
<li><a href="#%E5%AD%A6%E7%82%B9%E8%8B%B1%E8%AF%AD">&#x5B66;&#x70B9;&#x82F1;&#x8BED;</a></li>
<li><a href="#%E7%94%BB%E4%B8%AA%E5%9B%BE%E6%83%B3%E4%B8%80%E6%83%B3%E5%86%8D%E5%81%9A">&#x753B;&#x4E2A;&#x56FE;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;&#x518D;&#x505A;</a></li>
<li><a href="#%E5%88%A9%E7%94%A8%E5%A5%BD%E4%B8%8B%E7%8F%AD%E6%97%B6%E9%97%B4%E5%AD%A6%E4%B9%A0">&#x5229;&#x7528;&#x597D;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x5B66;&#x4E60;</a></li>
<li><a href="#%E5%88%97%E5%A5%BD-todo">&#x5217;&#x597D; ToDo</a></li>
<li><a href="#%E5%8F%8D%E6%80%9D%E5%92%8C%E6%95%B4%E7%90%86">&#x53CD;&#x601D;&#x548C;&#x6574;&#x7406;</a></li>
</ul>
<!-- END doctoc generated TOC please keep comment here to allow auto update -->
<p>&#x4F60;&#x662F;&#x5426;&#x65F6;&#x5E38;&#x4F1A;&#x7126;&#x8651;&#x65F6;&#x95F4;&#x8FC7;&#x7684;&#x5F88;&#x5FEB;&#xFF0C;&#x6CA1;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#xFF0C;&#x672C;&#x6587;&#x5C06;&#x4F1A;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x7684;&#x89C1;&#x89E3;&#x3002;</p>
<h3 id="&#x82B1;&#x65F6;&#x95F4;&#x8865;&#x57FA;&#x7840;&#xFF0C;&#x8BFB;&#x6587;&#x6863;">&#x82B1;&#x65F6;&#x95F4;&#x8865;&#x57FA;&#x7840;&#xFF0C;&#x8BFB;&#x6587;&#x6863;</h3>
<p>&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x6211;&#x4EEC;&#x65F6;&#x5E38;&#x4F1A;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x53BB; debug&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x662F;&#x5426;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x6700;&#x7EC8;&#x53EA;&#x662F;&#x4F60;&#x57FA;&#x7840;&#x4E0D;&#x624E;&#x5B9E;&#x6216;&#x8005;&#x6587;&#x6863;&#x6CA1;&#x6709;&#x4ED4;&#x7EC6;&#x770B;&#x3002;</p>
<p>&#x57FA;&#x7840;&#x662F;&#x4F60;&#x6280;&#x672F;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x6253;&#x597D;&#x57FA;&#x7840;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FFD;&#x5404;&#x79CD;&#x65B0;&#x7684;&#x6280;&#x672F;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x624E;&#x5B9E;&#xFF0C;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x65B0;&#x7684;&#x6280;&#x672F;&#x4E5F;&#x80AF;&#x5B9A;&#x4E0D;&#x5728;&#x8BDD;&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x7A76;&#x5176;&#x6839;&#x672C;&#x90FD;&#x662F;&#x76F8;&#x901A;&#x7684;&#x3002;</p>
<p>&#x6587;&#x6863;&#x540C;&#x6837;&#x4E5F;&#x662F;&#x4E00;&#x95E8;&#x6280;&#x672F;&#x7684;&#x57FA;&#x7840;&#x3002;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x5E93;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80AF;&#x5B9A;&#x5DF2;&#x7ECF;&#x628A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5E93;&#x90FD;&#x5199;&#x5728;&#x6587;&#x6863;&#x4E2D;&#x4E86;&#xFF0C;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x6587;&#x6863;&#x4E00;&#x5B9A;&#x4F1A;&#x662F;&#x5C11;&#x5199; bug &#x7684;&#x6700;&#x7701;&#x4E8B;&#x8DEF;&#x5B50;&#x3002;</p>
<h3 id="&#x5B66;&#x4F1A;&#x641C;&#x7D22;">&#x5B66;&#x4F1A;&#x641C;&#x7D22;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x5728;&#x4F7F;&#x7528;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x5C3D;&#x5FEB;&#x629B;&#x5F03;&#x8FD9;&#x4E2A;&#x5783;&#x573E;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;&#x540C;&#x6837;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x4F7F;&#x7528;&#x767E;&#x5EA6;&#x548C;&#x8C37;&#x6B4C;&#xFF0C;&#x8C37;&#x6B4C;&#x57FA;&#x672C;&#x5B8C;&#x80DC;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x4F7F;&#x7528;&#x4E2D;&#x6587;&#x5728;&#x8C37;&#x6B4C;&#x4E2D;&#x641C;&#x7D22;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x5F80;&#x5F80;&#x662F;&#x8C37;&#x6B4C;&#x5360;&#x4F18;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8FC5;&#x901F;&#x7684;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x8C37;&#x6B4C;&#x3002;</p>
<h3 id="&#x5B66;&#x70B9;&#x82F1;&#x8BED;">&#x5B66;&#x70B9;&#x82F1;&#x8BED;</h3>
<p>&#x8BF4;&#x5230;&#x82F1;&#x8BED;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x5927;&#x5BB6;&#x6240;&#x6700;&#x4E0D;&#x60F3;&#x542C;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x662F;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x4E2D;&#x662F;&#x4E00;&#x76F4;&#x63A5;&#x89E6;&#x7740;&#x82F1;&#x8BED;&#xFF0C;&#x5E76;&#x4E14;&#x770B;&#x61C2;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x6587;&#x6863;&#x6240;&#x9700;&#x8981;&#x7684;&#x5355;&#x8BCD;&#x91CF;&#x662F;&#x6781;&#x5C11;&#x7684;&#x3002;&#x6211;&#x65F6;&#x5E38;&#x5728;&#x7FA4;&#x91CC;&#x770B;&#x5230;&#x5927;&#x5BB6;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x622A;&#x56FE;&#x95EE;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x622A;&#x56FE;&#x4E2D;&#x82F1;&#x8BED;&#x5DF2;&#x7ECF;&#x5F88;&#x660E;&#x767D;&#x7684;&#x8BF4;&#x660E;&#x4E86;&#x95EE;&#x9898;&#x7684;&#x6240;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x8FC7;&#x5173;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x9700;&#x8981;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x6765;&#x63D0;&#x95EE;&#x548C;&#x641C;&#x7D22;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#x5B66;&#x70B9;&#x82F1;&#x8BED;&#x4E5F;&#x662F;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x4E2D;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x53BB;&#x5B66;&#x4E60;&#x5462;&#xFF0C;chrome &#x88C5;&#x4E2A;&#x7FFB;&#x8BD1;&#x63D2;&#x4EF6;&#xFF0C;&#x76F4;&#x63A5;&#x62FF;&#x82F1;&#x6587;&#x6587;&#x6863;&#x6216;&#x6587;&#x7AE0;&#x8BFB;&#xFF0C;&#x4E0D;&#x4F1A;&#x7684;&#x5C31;&#x76F4;&#x63A5;&#x5212;&#x8BCD;&#x7FFB;&#x8BD1;&#xFF0C;&#x7136;&#x540E;&#x8BB0;&#x5F55;&#x4E0B;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x5E76;&#x80CC;&#x8BF5;&#x3002;&#x6BCF;&#x5929;&#x82B1;&#x534A;&#x5C0F;&#x65F6;&#x770B;&#x70B9;&#x82F1;&#x6587;&#x6587;&#x6863;&#x548C;&#x6587;&#x7AE0;&#xFF0C;&#x575A;&#x6301;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;&#x4E0D;&#x8BF4;&#x522B;&#x7684;&#xFF0C;&#x770B;&#x6587;&#x6863;&#x548C;&#x6587;&#x7AE0;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x6709;&#x96BE;&#x9898;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5212;&#x7B97;&#x7684;&#x4E2A;&#x4EBA;&#x65F6;&#x95F4;&#x6295;&#x8D44;&#xFF0C;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#xFF0C;&#x80FD;&#x4E3A;&#x4F60;&#x5C06;&#x6765;&#x7684;&#x6280;&#x672F;&#x4E4B;&#x8DEF;&#x94FA;&#x5E73;&#x5F88;&#x591A;&#x574E;&#x3002;</p>
<h3 id="&#x753B;&#x4E2A;&#x56FE;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;&#x518D;&#x505A;">&#x753B;&#x4E2A;&#x56FE;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;&#x518D;&#x505A;</h3>
<p>&#x4F60;&#x662F;&#x5426;&#x9047;&#x5230;&#x8FC7;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x6C42;&#x4E00;&#x4E0B;&#x6765;&#xFF0C;&#x770B;&#x4E00;&#x773C;&#xFF0C;&#x7136;&#x540E;&#x9A6C;&#x4E0A;&#x5C31;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x7A3F;&#x5F00;&#x59CB;&#x505A;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4E2D;&#x95F4;&#x51FA;&#x4E2A;&#x95EE;&#x9898;&#x5BFC;&#x81F4;&#x4F60;&#x9700;&#x8981;&#x8FD4;&#x5DE5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5B58;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5F88;&#x63A8;&#x8350;&#x5728;&#x770B;&#x5230;&#x8BBE;&#x8BA1;&#x7A3F;&#x548C;&#x9700;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x753B;&#x4E00;&#x753B;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E2D;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x53EF;&#x4EE5;&#x62C6;&#x5206;&#x51FA;&#x6765;&#x7684;&#x590D;&#x7528;&#x7EC4;&#x4EF6;&#xFF0C;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4E4B;&#x524D;&#x5199;&#x8FC7;&#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x8BE5;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x8FD9;&#x4E2A;&#x754C;&#x9762;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x6D41;&#x8F6C;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#x3002;&#x7136;&#x540E;&#x753B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x52A8;&#x624B;&#x505A;&#x3002;</p>
<h3 id="&#x5229;&#x7528;&#x597D;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x5B66;&#x4E60;">&#x5229;&#x7528;&#x597D;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x5B66;&#x4E60;</h3>
<p>&#x8BF4;&#x5230;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x5C31;&#x6709;&#x4EBA;&#x8BF4;&#x4E86;&#x516C;&#x53F8;&#x5F88;&#x8FDF;&#x4E0B;&#x73ED;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x56FD;&#x5185;&#x5F88;&#x666E;&#x904D;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F46;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x6B63;&#x5E38;&#x7684;&#x52A0;&#x73ED;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5F3A;&#x5236;&#x7684;&#x52A0;&#x73ED;&#x5C31;&#x662F;&#x5728;&#x635F;&#x8017;&#x4F60;&#x7684;&#x8EAB;&#x4F53;&#x548C;&#x524D;&#x9014;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684; 996 &#x516C;&#x53F8;&#xFF0C;&#x52A0;&#x73ED;&#x7684;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x5E76;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x4F60;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x5728;&#x5199;&#x4E00;&#x4E9B;&#x91CD;&#x590D;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x53EF;&#x4EE5;&#x62FF;&#x5230;&#x66F4;&#x591A;&#x7684;&#x94B1;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x4EF7;&#x662F;&#x8EAB;&#x4F53;&#x8FD8;&#x6709;&#x524D;&#x9014;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x9760;&#x6280;&#x672F;&#x5403;&#x996D;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x957F;&#x4E45;&#x5446;&#x5728;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x95F4;&#x52A0;&#x73ED;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4E0D;&#x80FD;&#x589E;&#x957F;&#x4F60;&#x7684;&#x6280;&#x672F;&#x8FD8;&#x8981;&#x541E;&#x566C;&#x4F60;&#x7684;&#x4E0B;&#x73ED;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4E00;&#x5B9A;&#x4F1A;&#x5E9F;&#x6389;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x80FD;&#x63A8;&#x8350;&#x5C3D;&#x5FEB;&#x8DF3;&#x69FD;&#x5230;&#x975E; 996 &#x7684;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x82B1;&#x4E0A; 1&#xFF0C; 2 &#x5C0F;&#x65F6;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x4E0A;&#x73ED;&#x5927;&#x5BB6;&#x57FA;&#x672C;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6280;&#x672F;&#x7684;&#x7CBE;&#x8FDB;&#x5C31;&#x662F;&#x770B;&#x4E0B;&#x73ED;&#x4EE5;&#x540E;&#x7684;&#x90A3;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x5229;&#x7528;&#x597D;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF0C;&#x65F6;&#x95F4;&#x4E00;&#x5B9A;&#x4F1A;&#x7ED9;&#x4F60;&#x5F88;&#x597D;&#x7684;&#x7B54;&#x590D;&#x3002;</p>
<h3 id="&#x5217;&#x597D;-todo">&#x5217;&#x597D; ToDo</h3>
<p>&#x6211;&#x559C;&#x6B22;&#x89C4;&#x5212;&#x597D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x4E14;&#x8981;&#x628A;&#x4E8B;&#x60C5;&#x62C6;&#x5206;&#x4E3A;&#x5C0F;&#x70B9;&#x3002;&#x7ED9; ToDo &#x5217;&#x597D;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x7D27;&#x6025;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#x3002;&#x76F8;&#x540C;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x6211;&#x559C;&#x6B22;&#x5148;&#x505A;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x4E00;&#x65E6;&#x5B8C;&#x6210;&#x5C31;&#x80FD;&#x5212;&#x6389;&#x4E00;&#x4E2A;&#xFF0C;&#x63D0;&#x9AD8;&#x6210;&#x5C31;&#x611F;&#x3002;</p>
<h3 id="&#x53CD;&#x601D;&#x548C;&#x6574;&#x7406;">&#x53CD;&#x601D;&#x548C;&#x6574;&#x7406;</h3>
<p>&#x6BCF;&#x5468;&#x672B;&#x90FD;&#x4F1A;&#x82B1;&#x4E0A;&#x70B9;&#x65F6;&#x95F4;&#x6574;&#x7406;&#x4E0B;&#x672C;&#x5468;&#x8BB0;&#x5F55;&#x7684;&#x7B14;&#x8BB0;&#x548C;&#x770B;&#x5230;&#x7684;&#x4E0D;&#x9519;&#x6587;&#x7AE0;&#x3002;&#x7136;&#x540E;&#x8003;&#x8651;&#x4E0B;&#x672C;&#x5468;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x4E0B;&#x5468;&#x51C6;&#x5907;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<footer class="page-footer"><span class="copyright">&#xA9; Tony all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2019-8-16 13:26:02
</span></footer></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../Safety/safety-cn.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 安全">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"习惯与技巧","level":"1.12","depth":1,"previous":{"title":"安全","level":"1.11","depth":1,"path":"docs/Safety/safety-cn.md","ref":"docs/Safety/safety-cn.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","chapter-fold","code","favicon","tbfed-pagefooter","-sharing","sharing-plus","github","github-buttons","lightbox"],"styles":{"website":"/source/css/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"&copy Tony","modify_label":"该文件修订时间：","modify_format":"2019-8-16 13:26:02"},"chapter-fold":{},"github":{"url":"https://github.com/Tony-Code"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"/source/images/favicon.ico","bookmark":"/source/images/favicon.ico","appleTouch":"/source/images/favicon.ico","appleTouchMore":{"120x120":"/source/images/favicon.ico","180x180":"/source/images/favicon.ico"}},"lightbox":{"jquery":true},"github-buttons":{"buttons":[{"user":"Tony-Code","repo":"UED-Interview","type":"star","size":"small","count":true}]},"sharing":{"qq":false,"all":["weibo","qq","qzone","douban"],"douban":false,"facebook":true,"weibo":false,"twitter":true,"pocket":false,"google":true,"qzone":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"tony","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"前端面试之道","language":"zh-hans","gitbook":"3.2.3","description":"前端面试之道"},"file":{"path":"docs/Career/How-to-use-your-time-correctly.md","mtime":"2019-07-27T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-16T10:34:10.490Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

